tuvuquang/clean-code/bai-7/SDK_1.0.3_NUCLEO-F401RE/shared/Drivers/STM32F401RE_StdPeriph_Driver/src/stm32f401re_adc.c
    [..] A typical configuration to get the Temperature sensor and Vrefint channels
         voltages is done following these steps :
      (#) Enable the internal connection of Temperature sensor and Vrefint sources
          with the ADC channels using ADC_TempSensorVrefintCmd() function.
      (#) Select the ADC_Channel_TempSensor and/or ADC_Channel_Vrefint using
          ADC_RegularChannelConfig() or  ADC_InjectedChannelConfig() functions
      (#) Get the voltage values, using ADC_GetConversionValue() or
          ADC_GetInjectedConversionValue().

    [..] A typical configuration to get the VBAT channel voltage is done following
         these steps :
      (#) Enable the internal connection of VBAT source with the ADC channel using
          ADC_VBATCmd() function.
      (#) Select the ADC_Channel_Vbat using ADC_RegularChannelConfig() or
          ADC_InjectedChannelConfig() functions
      (#) Get the voltage value, using ADC_GetConversionValue() or
          ADC_GetInjectedConversionValue().

@endverbatim
  * @{
  */


/**
  * @brief  Enables or disables the temperature sensor and Vrefint channels.
  * @param  NewState: new state of the temperature sensor and Vrefint channels.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ADC_TempSensorVrefintCmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  if (NewState != DISABLE)
  {
    /* Enable the temperature sensor and Vrefint channel*/
    ADC->CCR |= (uint32_t)ADC_CCR_TSVREFE;
  }
  else
  {
    /* Disable the temperature sensor and Vrefint channel*/
    ADC->CCR &= (uint32_t)(~ADC_CCR_TSVREFE);
  }
}

/**
  * @brief  Enables or disables the VBAT (Voltage Battery) channel.
  *
  * @note   the Battery voltage measured is equal to VBAT/2 on STM32F40xx and
  *         STM32F41xx devices and equal to VBAT/4 on STM32F42xx and STM32F43xx devices
  *
  * @param  NewState: new state of the VBAT channel.
  *          This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ADC_VBATCmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));
  if (NewState != DISABLE)
  {
    /* Enable the VBAT channel*/
    ADC->CCR |= (uint32_t)ADC_CCR_VBATE;
  }
  else
  {
    /* Disable the VBAT channel*/
    ADC->CCR &= (uint32_t)(~ADC_CCR_VBATE);
  }
}

/**
  * @}
  */

/** @defgroup ADC_Group4 Regular Channels Configuration functions
 *  @brief   Regular Channels Configuration functions
 *
@verbatim
 ===============================================================================
             ##### Regular Channels Configuration functions #####
 ===============================================================================

    [..] This section provides functions allowing to manage the ADC's regular channels,
         it is composed of 2 sub sections :

      (#) Configuration and management functions for regular channels: This subsection
          provides functions allowing to configure the ADC regular channels :
         (++) Configure the rank in the regular group sequencer for each channel
         (++) Configure the sampling time for each channel
         (++) select the conversion Trigger for regular channels
         (++) select the desired EOC event behavior configuration
         (++) Activate the continuous Mode  (*)
         (++) Activate the Discontinuous Mode
         -@@- Please Note that the following features for regular channels
             are configured using the ADC_Init() function :
           (+@@) scan mode activation
           (+@@) continuous mode activation (**)
           (+@@) External trigger source
           (+@@) External trigger edge
           (+@@) number of conversion in the regular channels group sequencer.

         -@@- (*) and (**) are performing the same configuration

      (#) Get the conversion data: This subsection provides an important function in
          the ADC peripheral since it returns the converted data of the current
          regular channel. When the Conversion value is read, the EOC Flag is
          automatically cleared.

          -@- For multi ADC mode, the last ADC1, ADC2 and ADC3 regular conversions
              results data (in the selected multi mode) can be returned in the same
              time using ADC_GetMultiModeConversionValue() function.

@endverbatim
  * @{
  */
/**
  * @brief  Configures for the selected ADC regular channel its corresponding
  *         rank in the sequencer and its sample time.
  * @param  ADCx: where x can be 1, 2 or 3 to select the ADC peripheral.
  * @param  ADC_Channel: the ADC channel to configure.
  *          This parameter can be one of the following values:
  *            @arg ADC_Channel_0: ADC Channel0 selected
  *            @arg ADC_Channel_1: ADC Channel1 selected
  *            @arg ADC_Channel_2: ADC Channel2 selected
  *            @arg ADC_Channel_3: ADC Channel3 selected
  *            @arg ADC_Channel_4: ADC Channel4 selected
  *            @arg ADC_Channel_5: ADC Channel5 selected
  *            @arg ADC_Channel_6: ADC Channel6 selected
  *            @arg ADC_Channel_7: ADC Channel7 selected
  *            @arg ADC_Channel_8: ADC Channel8 selected
  *            @arg ADC_Channel_9: ADC Channel9 selected
  *            @arg ADC_Channel_10: ADC Channel10 selected
  *            @arg ADC_Channel_11: ADC Channel11 selected
  *            @arg ADC_Channel_12: ADC Channel12 selected
  *            @arg ADC_Channel_13: ADC Channel13 selected
  *            @arg ADC_Channel_14: ADC Channel14 selected
  *            @arg ADC_Channel_15: ADC Channel15 selected
  *            @arg ADC_Channel_16: ADC Channel16 selected
  *            @arg ADC_Channel_17: ADC Channel17 selected
  *            @arg ADC_Channel_18: ADC Channel18 selected
  * @param  Rank: The rank in the regular group sequencer.
  *          This parameter must be between 1 to 16.
  * @param  ADC_SampleTime: The sample time value to be set for the selected channel.
  *          This parameter can be one of the following values:
  *            @arg ADC_SampleTime_3Cycles: Sample time equal to 3 cycles
  *            @arg ADC_SampleTime_15Cycles: Sample time equal to 15 cycles
  *            @arg ADC_SampleTime_28Cycles: Sample time equal to 28 cycles
  *            @arg ADC_SampleTime_56Cycles: Sample time equal to 56 cycles
  *            @arg ADC_SampleTime_84Cycles: Sample time equal to 84 cycles
  *            @arg ADC_SampleTime_112Cycles: Sample time equal to 112 cycles
  *            @arg ADC_SampleTime_144Cycles: Sample time equal to 144 cycles
  *            @arg ADC_SampleTime_480Cycles: Sample time equal to 480 cycles
  * @retval None
  */
void ADC_RegularChannelConfig(ADC_TypeDef* ADCx, uint8_t ADC_Channel, uint8_t Rank, uint8_t ADC_SampleTime)
{
  uint32_t tmpreg1 = 0, tmpreg2 = 0;
  /* Check the parameters */
  assert_param(IS_ADC_ALL_PERIPH(ADCx));
  assert_param(IS_ADC_CHANNEL(ADC_Channel));
  assert_param(IS_ADC_REGULAR_RANK(Rank));
  assert_param(IS_ADC_SAMPLE_TIME(ADC_SampleTime));

